utilities/2D_syngas_premixed/0.org/Ydefault
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ydefault;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    patch0_half0
    {
        type            empty;
    }
    patch0_half1
    {
        type            empty;
    }
    patch1_half0
    {
        type            zeroGradient;
    }
    patch1_half1
    {
        type            zeroGradient;
    }
    patch2_half0
    {
        type            zeroGradient;
    }
    patch2_half1
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
