utilities/2D_syngas_premixed/constant/initialFlameProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
version                         2.0;
format                          ascii;
class                           dictionary;
object                          initialFlameProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// transform 1D premixed Flame into 1/2/3D domain as initial conditions with sin function fluctuation.

type circle;//plane;//

startPoint startPoint [0 0 0 0 0] (0.004 0.004 0);//(0 0 0);
amplitudeFactor  0; // real amplitude = initialFlameThickness*amplitudeFactor;
frequency  0;  //  2*pi*frequency
reverse  off; // reverse the default unburnt and burnt regions

// for circle
radius                   radius [0 1 0 0 0] 1e-3;
// for circle

// for plane
twin off; // generate twin flame front
distance                    distance [0 1 0 0 0] 1e-3;
flameNormalDirection  flameNormalDirection [0 0 0 0 0] (0 1 0);
flameFluctuationDirection  flameFluctuationDirection [0 0 0 0 0] (1 0 0);
// for plane


/*
Note: current code only test in 2D Case.
Data in 1DFlame.dat
	0			1			2		3		4		5   ... N
0	distance	Temperature Y_0		Y_1		Y_2		Y_3 ... Y_N (same species order in the chemical mechanism)
1	(unburnt conditions)
.	d_1
.		    estimated initial flameThickness = (d_M-1 - d_1)
.	d_M-1
M	(burnt conditions)
*/
