utilities/2D_syngas_premixed/system/sampleDict:Zone.Identifier
[ZoneTransfer]
ZoneId=3
ReferrerUrl=C:\Users\40367\Downloads\1DFlameSin2Foam-main.zip
